{"https://blog.counter-strike.net/index.php/2021/05/34198/": {"ReleaseNotes": "Release Notes for 5/13/2021", "Date": "Date : 2021.05.13   ", "PatchNotes": "[CSGO 360 STATS]\n– Adjusted the calculation for the weapon performance category score.[MISC]\n– Fixed a case where players would receive duplicate warnings about launching in untrusted mode. [MAPS] \nAncient\n-Implemented Cubby 2.0 in mid connector to A, to remove cheap shoulder angle towards site\n-Slimmed down the fancy rock, also in mid connector to A\n-Sparsed foliage and improved clipping on boost planter near A main\n-Quieted down soundscape birds\n-Removed clipping from top of bombsite sign in A site, allowing you to self-boost to planter by T main\n-Added vphysics clip to T spawn water so guns don’t fully submerge\n-So many clip brush tweaks\n-Blocked grenades from entering inaccessible building by T entrance to mid\n-Blocked pixelgaps through scaffolding near B site\n-Blocked pixelgaps through doorway trim in new CT path to A site\n-Simplified grenade collision on rooftops\n-General optimizationsGrind\n– Made wall on A long surfable\n– Fixed invisible wall near B site\n– Fixed out of map boost near A site\n– Fixed collision of wall near A site\n– Fixed collision of pillars around A site\n– Minor art updates around T spawnFrostbite\n– Fixed a regression with airdrops\n– Fixed stuck spots (thanks Jakob & conzept)\n– Fixed a gap in terrain\n– Reworked watchtower models"}, "https://blog.counter-strike.net/index.php/2021/05/34263/": {"ReleaseNotes": "Release Notes for 5/27/2021", "Date": "Date : 2021.05.27   ", "PatchNotes": "[ MISC ]\n– Added option ‘2’ to sv_damage_print_enable, which, when set, will only print damage output after round has ended.\n– Coach positions are now saved in round backup files.\n– In Deathmatch, fixed the ability to extend invulnerability by repeatedly issuing the “open_buymenu” command.\n– In Retakes, armor value now remains fixed during card selection.[ VSCRIPT ]\n– Fixed bounding box issue for rotated entities.[ MAPS ]\n– Ancient\n— Art-revision on bombsite B and surrounding area\n— Higher contrast base textures at B for better player reads\n— Fixed random missing micro-polygons in bomb B totem/sculpture\n— Recolored plywood throughout the map for better contrast\n— Straightened out broken-wall passage to bombsite B\n— Tweaked spawnpoint placement for both teams– Grind\n— Reduced lurk positions in mid for more fluid rotations.\n— Lowered cover on A Short to allow boosting over smokes.\n— Removed unintended boost locations.\n— Fixed multiple bomb stuck spots.\n— Minor quality of life and art updates.– Mocha\n— Clipping improvements.\n— Navigation mesh improvements.\n— Added additional bombsite markers.\n— Bug fixes: deathmatch gamemode spawns, CT spawn soundscape, minor lighting errors.– Cache\n— Performance optimizations. (Thanks leplubodeslapin!)\n— Reduced bird sounds volume.\n— Reduced contrast on some textures.\n— Brightened sky slightly.\n— Fixed minor issues. (Thanks imik!)\n— Restored vivid color to select textures and models.\n— Restored select details even on lowest graphical settings."}, "https://blog.counter-strike.net/index.php/2021/06/34389/": {"ReleaseNotes": "Release Notes for 6/3/2021", "Date": "Date : 2021.06.03   ", "PatchNotes": "[NON-PRIME]\n– Non-Prime status accounts will no longer earn XP, Ranks, Skill Groups, item drops, or Prime status through play time.\n– Non-Prime accounts will not be able to participate in Ranked matches.\n– Non-Prime accounts will not be able to activate Bonus Rank XP items and can no longer claim Service Medals.[UNRANKED MATCHES]\n– Introducing Unranked matches for Competitive, Wingman, and Danger Zone game modes.\n— While still using skill-based matchmaking, Unranked matches do not affect Skill Group and have no Skill Group party restrictions.\n— Non-Prime accounts are restricted to Unranked, whereas Prime accounts may choose between Ranked and Unranked.\n— Ranked matches will always be with other Prime players, exclusively, whereas Unranked matches will be created from the mixed pool of Non-Prime players — and Prime players that have chosen to play Unranked.[VSCRIPT]\n– Added “DebugDrawBoxAngles” to draw oriented bounding boxes. Usage: DebugDrawBoxAngles( ent.GetOrigin(), ent.GetBoundingMins(), ent.GetBoundingMaxs(), ent.GetAngles(), r, g, b, a, time);\n– Added “GetBoundingMinsOriented” and “GetBoundingMaxsOriented” functions that return the axis-aligned bounding box of an entity taking its current orientation into account.[MISC]\n– Scrimmage has been removed from Competitive matchmaking, and has been replaced by Unranked matchmaking.\n– Added Import button to Workshop Workbench that takes a .tga file and generates a .vtf file. If the .tga file name contains “_normal” the generated .vtf file will be compiled with the ‘normal’ flag."}, "https://blog.counter-strike.net/index.php/2021/06/34552/": {"ReleaseNotes": "Release Notes for 6/8/2021", "Date": "Date : 2021.06.08   ", "PatchNotes": "[UI]\n– Fixed live match links in the event panel.[ SDK ]\n– Updated AI Behavior Trees\n— Added new “action_secondary_attack” node.\n— Added new “action_reload” and “condition_is_reloading” nodes.\n— Ammo counts for all weapons are available on the Blackboard via “AmmoCount/weapon_name” key, with “AmmoCount/current” holding the ammo count for the currently equipped weapon. These can be read using nodes such as “condition_is_less”, “condition_is_equal”, etc.[MAPS]\nPitstop\n– Map-wide graphical update with new textures and models.\n– Improved optimization.\n– Removed cubby under drop-down.\n– Lighting and clipping adjustments."}, "https://blog.counter-strike.net/index.php/2021/07/34659/": {"ReleaseNotes": "Release Notes for 7/6/2021", "Date": "Date : 2021.07.06   ", "PatchNotes": "[ MATCHMAKING ]\n– Premier matchmaking can now be selected together with other competitive maps.\n– Added competitive matchmaking presets and ability to save/load favorite map selections.\n– Added a link to CS:GO Fair Play Guidelines when playing on official game servers.[ MISC ]\n– Bullet penetration check will ignore the firing player model entirely.\n– Fixed bot difficulty selector to correctly apply for offline with bots War Games matches.\n– Stability improvements."}, "https://blog.counter-strike.net/index.php/2021/07/34956/": {"ReleaseNotes": "Release Notes for 7/27/2021", "Date": "Date : 2021.07.27   ", "PatchNotes": "[Maps]\n– Calavera\n— Added more contrast to the door texture to make it stand out more (thanks TheWarOwl and Quoting)\n— Moved ladder at T-stairs slightly to make going up more smooth\n— Various fixes to pixel gaps and clipping that no one will even notice or care about[MISC]\n– Stability improvements."}}